tutorials/dieSwell/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  2606
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   0.001; // mm to m

// 2.5 deg half-angle (5 deg total wedge)
// tan(2.5 deg) = 0.0436609
// cos(2.5 deg) = 0.9990482, sin(2.5 deg) = 0.0436194
vertices
(
    // Plane z = 0 mm (die inlet)
    ( 0.000000  0.000000  0.0 ) // 0: r=0, -wedge
    ( 0.999048 -0.043619  0.0 ) // 1: r=1, -wedge
    ( 0.999048  0.043619  0.0 ) // 2: r=1, +wedge

    // Plane z = 5 mm (die exit)
    ( 0.000000  0.000000  5.0 ) // 3: r=0, -wedge
    ( 0.999048 -0.043619  5.0 ) // 4: r=1, -wedge
    ( 0.999048  0.043619  5.0 ) // 5: r=1, +wedge
    ( 2.997145 -0.130858  5.0 ) // 6: r=3, -wedge
    ( 2.997145  0.130858  5.0 ) // 7: r=3, +wedge

    // Plane z = 15 mm (outlet)
    ( 0.000000  0.000000 15.0 ) // 8: r=0, -wedge
    ( 0.999048 -0.043619 15.0 ) // 9: r=1, -wedge
    ( 0.999048  0.043619 15.0 ) // 10: r=1, +wedge
    ( 2.997145 -0.130858 15.0 ) // 11: r=3, -wedge
    ( 2.997145  0.130858 15.0 ) // 12: r=3, +wedge
);

blocks
(
    // Block 0: Die interior (r: 0->1 mm, z: 0->5 mm)
    // local x: 0->1 (r), local y: 0->3 (theta), local z: 0->4 (z)
    hex (0 1 2 0 3 4 5 3) (15 1 50) simpleGrading (1 1 1)

    // Block 1: Swell core (r: 0->1 mm, z: 5->15 mm)
    hex (3 4 5 3 8 9 10 8) (15 1 100) simpleGrading (1 1 1)

    // Block 2: Swell outer expansion (r: 1->3 mm, z: 5->15 mm)
    hex (4 6 7 5 9 11 12 10) (20 1 100) simpleGrading (1 1 1)
);

edges
();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 2 1 0)
        );
    }
    dieWall
    {
        type wall;
        faces
        (
            (1 2 5 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 10 8)
            (9 11 12 10)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (6 11 12 7) // outer radius r=3 mm
            (4 6 7 5)   // die lip step at z=5 mm
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 3 5 2)
            (3 8 10 5)
            (5 10 12 7)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 1 4 3)
            (3 4 9 8)
            (4 6 11 9)
        );
    }
);
